{
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "background",
    "1": "candy",
    "2": "egg tart",
    "3": "french fries",
    "4": "chocolate",
    "5": "biscuit",
    "6": "popcorn",
    "7": "pudding",
    "8": "ice cream",
    "9": "cheese butter",
    "10": "cake",
    "11": "wine",
    "12": "milkshake",
    "13": "coffee",
    "14": "juice",
    "15": "milk",
    "16": "tea",
    "17": "almond",
    "18": "red beans",
    "19": "cashew",
    "20": "dried cranberries",
    "21": "soy",
    "22": "walnut",
    "23": "peanut",
    "24": "egg",
    "25": "apple",
    "26": "date",
    "27": "apricot",
    "28": "avocado",
    "29": "banana",
    "30": "strawberry",
    "31": "cherry",
    "32": "blueberry",
    "33": "raspberry",
    "34": "mango",
    "35": "olives",
    "36": "peach",
    "37": "lemon",
    "38": "pear",
    "39": "fig",
    "40": "pineapple",
    "41": "grape",
    "42": "kiwi",
    "43": "melon",
    "44": "orange",
    "45": "watermelon",
    "46": "steak",
    "47": "pork",
    "48": "chicken duck",
    "49": "sausage",
    "50": "fried meat",
    "51": "lamb",
    "52": "sauce",
    "53": "crab",
    "54": "fish",
    "55": "shellfish",
    "56": "shrimp",
    "57": "soup",
    "58": "bread",
    "59": "corn",
    "60": "hamburg",
    "61": "pizza",
    "62": "hanamaki baozi",
    "63": "wonton dumplings",
    "64": "pasta",
    "65": "noodles",
    "66": "rice",
    "67": "pie",
    "68": "tofu",
    "69": "eggplant",
    "70": "potato",
    "71": "garlic",
    "72": "cauliflower",
    "73": "tomato",
    "74": "kelp",
    "75": "seaweed",
    "76": "spring onion",
    "77": "rape",
    "78": "ginger",
    "79": "okra",
    "80": "lettuce",
    "81": "pumpkin",
    "82": "cucumber",
    "83": "white radish",
    "84": "carrot",
    "85": "asparagus",
    "86": "bamboo shoots",
    "87": "broccoli",
    "88": "celery stick",
    "89": "cilantro mint",
    "90": "snow peas",
    "91": "cabbage",
    "92": "bean sprouts",
    "93": "onion",
    "94": "pepper",
    "95": "green beans",
    "96": "French beans",
    "97": "king oyster mushroom",
    "98": "shiitake",
    "99": "enoki mushroom",
    "100": "oyster mushroom",
    "101": "white button mushroom",
    "102": "salad",
    "103": "other ingredients"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "French beans": 96,
    "almond": 17,
    "apple": 25,
    "apricot": 27,
    "asparagus": 85,
    "avocado": 28,
    "background": 0,
    "bamboo shoots": 86,
    "banana": 29,
    "bean sprouts": 92,
    "biscuit": 5,
    "blueberry": 32,
    "bread": 58,
    "broccoli": 87,
    "cabbage": 91,
    "cake": 10,
    "candy": 1,
    "carrot": 84,
    "cashew": 19,
    "cauliflower": 72,
    "celery stick": 88,
    "cheese butter": 9,
    "cherry": 31,
    "chicken duck": 48,
    "chocolate": 4,
    "cilantro mint": 89,
    "coffee": 13,
    "corn": 59,
    "crab": 53,
    "cucumber": 82,
    "date": 26,
    "dried cranberries": 20,
    "egg": 24,
    "egg tart": 2,
    "eggplant": 69,
    "enoki mushroom": 99,
    "fig": 39,
    "fish": 54,
    "french fries": 3,
    "fried meat": 50,
    "garlic": 71,
    "ginger": 78,
    "grape": 41,
    "green beans": 95,
    "hamburg": 60,
    "hanamaki baozi": 62,
    "ice cream": 8,
    "juice": 14,
    "kelp": 74,
    "king oyster mushroom": 97,
    "kiwi": 42,
    "lamb": 51,
    "lemon": 37,
    "lettuce": 80,
    "mango": 34,
    "melon": 43,
    "milk": 15,
    "milkshake": 12,
    "noodles": 65,
    "okra": 79,
    "olives": 35,
    "onion": 93,
    "orange": 44,
    "other ingredients": 103,
    "oyster mushroom": 100,
    "pasta": 64,
    "peach": 36,
    "peanut": 23,
    "pear": 38,
    "pepper": 94,
    "pie": 67,
    "pineapple": 40,
    "pizza": 61,
    "popcorn": 6,
    "pork": 47,
    "potato": 70,
    "pudding": 7,
    "pumpkin": 81,
    "rape": 77,
    "raspberry": 33,
    "red beans": 18,
    "rice": 66,
    "salad": 102,
    "sauce": 52,
    "sausage": 49,
    "seaweed": 75,
    "shellfish": 55,
    "shiitake": 98,
    "shrimp": 56,
    "snow peas": 90,
    "soup": 57,
    "soy": 21,
    "spring onion": 76,
    "steak": 46,
    "strawberry": 30,
    "tea": 16,
    "tofu": 68,
    "tomato": 73,
    "walnut": 22,
    "watermelon": 45,
    "white button mushroom": 101,
    "white radish": 83,
    "wine": 11,
    "wonton dumplings": 63
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "transformers_version": "5.0.0"
}
